In [6]:
import pandas as pd
import numpy as np

In [30]:
df = pd.DataFrame([[np.nan,2,np.nan,0],
                 [3,4,np.nan,1],
                 [np.nan,np.nan,np.nan,5]],
                 columns=list('ABCD'))

In [31]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [32]:
df.dropna(axis=1, how='all') # delete NaN // axix: 0=row, 1=column
# all = all data of row/column is null // any = at least one is null

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [33]:
df.fillna(0) # replace all NaN with value

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [34]:
values = {'name':0, 'toy':1,'born':2}
df.fillna(values)

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [38]:
fill_na_val = df['D'].max()

In [39]:
df.fillna(fill_na_val)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

In [41]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [43]:
df.notnull().sum()

A    1
B    2
C    0
D    3
dtype: int64